#include <iostream>
using namespace std;

int main() {
    cout << "April\n1   2   3   4   5   6\n7   8   9   10  11  12\n13  14  15  16  17  18\n!19! 18 19  20  21  22\n23  24  25  27  28  29\n30\n\n";
    cout << "  /\\\n /  \\\n/____\\\n|    |\n| __ |\n||  ||\n||__||\n|    |\n|_   |_____\n| |  |  |  |\n|_|__|__|__|\n\n";
    cout << "                                                       +++++          \n";
    cout << "+++++++++  ++     ++      ++++++++     +++++++++  ++        ++++  ++      ++\n";
    cout << "+++++++++   ++   ++     ++++++++++++   +++++++++  ++       ++ ++  ++      ++\n";
    cout << "++           ++ ++     +++        +++  ++         ++      ++  ++  ++      ++\n";
    cout << "++            +++     +++              ++         ++     ++   ++  ++      ++\n";
    cout << "++            ++      +++              +++++++++  ++    ++    ++  ++++++++++\n";
    cout << "++           ++       +++              +++++++++  ++   ++     ++  ++++++++++\n";
    cout << "++          ++         +++        +++  ++         ++  ++      ++  ++      ++\n";
    cout << "++         ++           ++++++++++++   +++++++++  ++ ++       ++  ++      ++\n";
    cout << "++         ++             ++++++++     +++++++++  ++++        ++  ++      ++\n";
    cout << "0-------0\\\n";
    cout << "          \\\n";
    cout << "           \\\n";
    cout << "           0_____\n";
    cout << "          /      0\n";
    cout << "         /       |\n";
    cout << "        /        |\n";
    cout << "       0_________0 \n\n";
    cout << "Я Гусейн Ибрагимов Магсад оглы. Мне 16 лет. Я учусь онлайн в школе №84 и в академии Шаг. Я в 10 классе и в следующем году мне сдавать ЗНО O_O. В будущем я хочу отучиться в Шаге и если будут достаточные знания начать работать в сфере программирования.\n";
    return 0;
}
